trunk/TraveGoodApp/test/09.02. GetItineraryTestCase - (For test 08.02)/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:travelgood.dtu.dk">
  <soapenv:Body>
    <urn:getItineraryRequest>
      <bookingNumber>DELETE_THIS_ASSIGN_LATER</bookingNumber>
    </urn:getItineraryRequest>
  </soapenv:Body>
</soapenv:Envelope>