trunk/TraveGoodApp/test/02. GetFlightsTestCase/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:travelgood.dtu.dk">
    <soapenv:Body>
        <urn:getFlightsRequest>
            <bookingNumber>DELETE_THIS_ASSIGN_LATER</bookingNumber>
            <from>ABC</from>
            <to>CBA</to>
            <takeOffDate>2014-10-10</takeOffDate>
        </urn:getFlightsRequest>
    </soapenv:Body>
</soapenv:Envelope>