trunk/TraveGoodApp/test/03. AddFlightTestCase/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:travelgood.dtu.dk" xmlns:urn1="urn:commons.travelgood.dtu.dk">
  <soapenv:Body>
    <urn:addFlightRequest>
      <bookingNumber>DELETE_THIS_ASSIGN_LATER</bookingNumber>
      <flight>
          <urn1:id>flight1</urn1:id>
          <urn1:bookingNumber>bookingNr1</urn1:bookingNumber>
          <urn1:carrier>SAS</urn1:carrier>
          <urn1:from>ABC</urn1:from>
          <urn1:to>CBA</urn1:to>
          <urn1:liftOffDate>2012-10-10</urn1:liftOffDate>
          <urn1:landingDate>2012-10-10</urn1:landingDate>
          <urn1:price>100</urn1:price>
        </flight>
    </urn:addFlightRequest>
  </soapenv:Body>
</soapenv:Envelope>