trunk/TravelGoodApp/test/01. CreateItineraryTest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:travelgood.dtu.dk">
    <soapenv:Body>
        <urn:createItineraryRequest>
            <userId>sample_user_id</userId>
        </urn:createItineraryRequest>
    </soapenv:Body>
</soapenv:Envelope>