trunk/TraveGoodApp/test/06. AddHotelTestCase/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:travelgood.dtu.dk" xmlns:urn1="urn:commons.travelgood.dtu.dk">
  <soapenv:Body>
    <urn:addHotelRequest>
      <bookingNumber>DELETE_THIS_ASSIGN_LATER</bookingNumber>
      <hotel>
          <urn1:id>hotel1</urn1:id>
          <urn1:bookingNumber>bookingNr1</urn1:bookingNumber>
          <urn1:name>Hilton</urn1:name>
          <urn1:address>
            <urn1:city>Paris</urn1:city>
            <urn1:street>Rue de lEtoile</urn1:street>
            <urn1:zipCode>75017</urn1:zipCode>
          </urn1:address>
          <urn1:provider>Provider1</urn1:provider>
          <urn1:price>500</urn1:price>
          <urn1:creditCardGuarantee>true</urn1:creditCardGuarantee>
      </hotel>
    </urn:addHotelRequest>
  </soapenv:Body>
</soapenv:Envelope>